[
    {
      "id": 1,
      "name": "Takashi Yamamoto",
      "picture": "https://www.pngkit.com/png/detail/30-300232_japan-chef-png.png",
      "bio": "Takashi Yamamoto is a well-known Japanese chef with more than 20 years of experience in the culinary industry. He has trained in some of the most prestigious restaurants in Japan, perfecting his skills in traditional Japanese cuisine. With over a decade of experience under his belt, Takashi has honed his craft and created a unique style that combines tradition with modern techniques. He has become a master of sushi rolls, tempura, ramen, miso soup, okonomiyaki, yakitori, tonkatsu, and soba noodles. He has amassed a following of nearly 8000 people who admire his delicious recipes and exceptional culinary skills.",
      "years_of_experience": 12,
      "num_of_recipes": 8,
      "like": 7887,
      "recipes": [  {    "name": "Sushi Rolls",    "ingredients": [      "Sushi rice",      "Nori sheets",      "Sashimi-grade fish (tuna, salmon, etc.)",      "Vegetables (cucumber, avocado, carrot, etc.)",      "Soy sauce",      "Wasabi",      "Pickled ginger"    ],
      "cookingMethod": "1. Cook the sushi rice and let it cool. 2. Place a nori sheet on a sushi mat. 3. Spread a layer of rice over the nori, leaving a 1-inch border at the top. 4. Add the filling (fish and/or vegetables) to the center of the rice. 5. Roll the sushi tightly using the sushi mat. 6. Cut the sushi roll into bite-size pieces. 7. Serve with soy sauce, wasabi, and pickled ginger.",
      "rating": 4.5
    },
    {
      "name": "Tempura",
      "ingredients": [
        "Shrimp or vegetables (sweet potato, broccoli, onion, etc.)",
        "Flour",
        "Cornstarch",
        "Egg",
        "Cold water",
        "Ice cubes",
        "Soy sauce",
        "Daikon radish",
        "Grated ginger"
      ],
      "cookingMethod": "1. Make the batter by mixing flour, cornstarch, egg, cold water, and ice cubes. 2. Heat the oil in a deep frying pan. 3. Dip the shrimp or vegetables into the batter. 4. Fry the tempura in the hot oil until golden brown. 5. Serve with soy sauce, grated daikon radish, and grated ginger.",
      "rating": 4.3
    },
    {
      "name": "Miso Soup",
      "ingredients": [
        "Dashi stock",
        "Miso paste",
        "Tofu",
        "Scallions",
        "Seaweed"
      ],
      "cookingMethod": "1. Heat the dashi stock in a pot. 2. Add miso paste and stir until it dissolves. 3. Add tofu and seaweed. 4. Cook for a few minutes until the tofu is heated through. 5. Garnish with sliced scallions. 6. Serve hot.",
      "rating": 4.8
    },
    {
      "name": "Gyoza",
      "ingredients": [
        "Ground pork",
        "Cabbage",
        "Garlic",
        "Ginger",
        "Green onion",
        "Soy sauce",
        "Sesame oil",
        "Gyoza wrappers"
      ],
      "cookingMethod": "1. Mix the ground pork, cabbage, garlic, ginger, green onion, soy sauce, and sesame oil in a bowl. 2. Place a spoonful of the mixture onto a gyoza wrapper. 3. Wet the edges of the wrapper with water. 4. Fold the wrapper in half and pleat the edges together. 5. Heat the oil in a frying pan. 6. Add the gyoza and cook until the bottom is browned. 7. Add water to the pan and cover to steam the gyoza. 8. Cook until the water has evaporated. 9. Serve with soy sauce and/or vinegar."
    },
    {
        "name": "Chicken Teriyaki",
        "ingredients": [
          "1 lb chicken thighs, boneless and skinless",
          "1/2 cup soy sauce",
          "1/2 cup water",
          "1/4 cup mirin",
          "2 tbsp sugar",
          "1 tbsp vegetable oil",
          "1 clove garlic, minced",
          "1 tsp ginger, minced"
        ],
        "cookingMethod": [
          "In a bowl, mix soy sauce, water, mirin and sugar until sugar is dissolved.",
          "Heat oil in a large skillet over medium heat. Add chicken and cook until browned, about 5 minutes per side.",
          "Add garlic and ginger to the skillet and cook until fragrant, about 1 minute.",
          "Pour the sauce over the chicken and bring to a boil. Reduce heat to low and simmer until sauce thickens and chicken is cooked through, about 10-15 minutes.",
          "Serve hot with steamed rice and vegetables."
        ],
        "rating": 4.5
      },
      {
        "name": "Tonkatsu",
        "ingredients": [
          "4 boneless pork chops",
          "1/2 cup all-purpose flour",
          "2 eggs, beaten",
          "1 cup panko breadcrumbs",
          "1/2 tsp salt",
          "1/4 tsp black pepper",
          "1/4 cup vegetable oil"
        ],
        "cookingMethod": [
          "Preheat the oven to 375°F (190°C).",
          "Season pork chops with salt and pepper.",
          "Dredge each chop in flour, dip in beaten eggs, and coat in panko breadcrumbs.",
          "Heat oil in a large skillet over medium-high heat. Add pork chops and cook until browned, about 2-3 minutes per side.",
          "Transfer the pork chops to a baking sheet and bake for 15-20 minutes, until fully cooked.",
          "Serve hot with tonkatsu sauce, shredded cabbage, and steamed rice."
        ],
        "rating": 4.3
      },
      {
        "name": "Soba Noodle Salad",
        "ingredients": [
          "8 oz soba noodles",
          "1/2 cup shredded carrots",
          "1/2 cup sliced cucumber",
          "1/2 cup sliced red bell pepper",
          "1/2 cup sliced scallions",
          "1/4 cup rice vinegar",
          "2 tbsp soy sauce",
          "1 tbsp sesame oil",
          "1 tbsp honey",
          "1 clove garlic, minced",
          "1 tsp grated ginger",
          "1 tbsp toasted sesame seeds"
        ],
        "cookingMethod": [
          "Cook soba noodles according to package directions. Drain and rinse with cold water.",
          "In a large bowl, mix together carrots, cucumber, red bell pepper, and scallions.",
          "In a separate bowl, whisk together rice vinegar, soy sauce, sesame oil, honey, garlic, and ginger.",
          "Toss soba noodles with the vegetables and dressing.",
          "Garnish with toasted sesame seeds and serve chilled."
        ],
        "rating": 4.7
      },
      {
        "name": "Takoyaki",
        "ingredients": [
          "1 cup all-purpose flour",
          "2 teaspoons baking powder",
          "1/4 teaspoon salt",
          "1 cup dashi stock",
          "1 large egg, beaten",
          "1/2 cup finely chopped cooked octopus",
          "2 green onions, thinly sliced",
          "1 tablespoon vegetable oil",
          "Toppings: Takoyaki sauce, mayonnaise, dried bonito flakes, aonori seaweed"
        ],
        "cookingMethod": [
          "In a large bowl, whisk together the flour, baking powder, and salt.",
          "Add the dashi stock and egg and whisk until well combined.",
          "Stir in the chopped octopus and green onions.",
          "Heat a takoyaki pan over medium heat and brush each well with vegetable oil.",
          "Spoon the batter into the wells until they are nearly full.",
          "Cook for 2-3 minutes, or until the bottoms are golden brown.",
          "Using a skewer or chopstick, flip each takoyaki over and cook for an additional 2-3 minutes, or until the other side is golden brown.",
          "Remove the takoyaki from the pan and top with takoyaki sauce, mayonnaise, dried bonito flakes, and aonori seaweed."
        ],
        "rating": 4.8
      }
    ]
    },

    {
      "id": 2,
      "name": "Yui Hashimoto",
      "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0lLmvBSFmdk-Wj9RMQ4ZJqV--ynQj89fz4Q&usqp=CAU",
      "bio": "Takashi Yamamoto is a well-known Japanese chef with more than 20 years of experience in the culinary industry. He has trained in some of the most prestigious restaurants in Japan, perfecting his skills in traditional Japanese cuisine. With over a decade of experience under his belt, Takashi has honed his craft and created a unique style that combines tradition with modern techniques. He has become a master of sushi rolls, tempura, ramen, miso soup, okonomiyaki, yakitori, tonkatsu, and soba noodles. He has amassed a following of nearly 8000 people who admire his delicious recipes and exceptional culinary skills.",
      "years_of_experience": 6,
      "num_of_recipes": 5,
      "like": 5432,
      "recipes": [
        "Tonkotsu Ramen",
        "Gyoza",
        "Teriyaki Chicken",
        "Miso Soup",
        "Okonomiyaki"
      ]
    },
    {
      "id": 3,
      "name": "Kenta Nakamura",
      "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2g2yTxhpg0DDm4hmJd8QZRBRcCUIe4aN97w&usqp=CAU",
      "bio": "Kenta Nakamura is a Japanese chef with a passion for fusion cuisine. He combines traditional Japanese ingredients and techniques with flavors from around the world to create unique and delicious dishes. Kenta has nine years of experience in the culinary industry and has mastered spicy tuna rolls, karaage chicken, beef teriyaki, soba noodle salad, miso soup, California roll, and green tea ice cream. His innovative approach to Japanese cuisine has earned him more than 4000 likes on social media.",
      "years_of_experience": 9,
      "num_of_recipes": 7,
      "like": 4319,
      "recipes": [
        "Spicy Tuna Roll",
        "Karaage Chicken",
        "Beef Teriyaki",
        "Soba Noodle Salad",
        "Miso Soup",
        "California Roll",
        "Green Tea Ice Cream"
      ]
    },
    {
      "id": 4,
      "name": "Aiko Suzuki",
      "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRVO6SOFPY2mHxntAvwcj2TomYmk4tR9xR4Aw&usqp=CAU",
      "bio": "Aiko Suzuki is a Japanese chef known for her inventive and playful take on traditional Japanese cuisine. With 15 years of experience in the industry, Aiko has won numerous awards for her dishes, which often feature surprising combinations of flavors and textures. Her mastery of matcha mochi, pork katsu, tofu salad, soba noodles, sushi rolls, miso soup, okonomiyaki, tonkatsu ramen, chicken teriyaki, and yakitori has earned her over 9000 likes on social media.",
      "years_of_experience": 15,
      "num_of_recipes": 6,
      "like": 9721,
      "recipes": [
        "Matcha Mochi",
        "Pork Katsu",
        "Tofu Salad",
        "Soba Noodles",
        "Sushi Rolls",
        "Miso Soup",
        "Okonomiyaki",
        "Tonkatsu Ramen",
        "Chicken Teriyaki",
        "Yakitori"
      ]
    },
    {    "id": 5,    "name": "Makoto Tanaka",    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAdC2A6TfwfMwudiJwrw6AkUyOHd5FLNGTLw&usqp=CAU",    "bio": "Makoto Tanaka is a renowned Japanese chef who specializes in traditional Kansai-style dishes. With 12 years of experience, he has been featured in numerous culinary magazines and television programs. Makoto has perfected sukiyaki, okonomiyaki, takoyaki, katsu don, tonkatsu, shabu-shabu, yakiniku, and soba noodles. He has earned the admiration of more than 3000 people who appreciate his exceptional culinary skills.",    "years_of_experience": 12,    "num_of_recipes": 8,    "like": 3000,    "recipes": ["Sukiyaki", "Okonomiyaki", "Takoyaki", "Katsu Don", "Tonkatsu", "Shabu-shabu", "Yakiniku", "Soba Noodles"]
  },
  {
    "id": 6,
    "name": "Haruka Nakamura",
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpo2BKlIPJtajId3fQ-I60ytPwRawwfk70MQ&usqp=CAU",
    "bio": "Haruka Nakamura is a skilled Japanese pastry chef known for her delicate and innovative dessert creations. With eight years of experience, Haruka has perfected matcha mousse cake, sakura chiffon cake, mochi ice cream, dorayaki, and Japanese cheesecake. Her mastery of pastry has earned her over 5500 likes on social media.",
    "years_of_experience": 8,
    "num_of_recipes": 5,
    "like": 5500,
    "recipes": ["Matcha Mousse Cake", "Sakura Chiffon Cake", "Mochi Ice Cream", "Dorayaki", "Japanese Cheesecake"]
  },
  {
    "id": 7,
    "name": "Ryota Fujimoto",
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSojhERgRKwJo4WJWL9yMN9tOOC99OoxBo52A&usqp=CAU",
    "bio": "Ryota Fujimoto is a young Japanese chef who specializes in sushi. With five years of experience, Ryota has perfected his skills in creating delicious sushi dishes that are both traditional and modern. He has created a loyal following of foodies who appreciate his creative and innovative approach to sushi-making.",
    "years_of_experience": 9,
    "num_of_recipes": 6,
    "like": 8000,
    "recipes": ["Yakitori", "Takoyaki", "Gyoza", "Karaage", "Edamame", "Shishamo"]
  },
  {
    "id": 8,
    "name": "Naoko Sato",
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSa6oEStYm-TtktckfEHMhhxs8uqAKFadfWZQ&usqp=CAU",
    "bio": "Naoko Sato is a highly skilled Japanese chef with 11 years of experience. Her passion lies in using seasonal ingredients to create inventive and visually stunning dishes. With four popular recipes under her belt, including Chirashi Sushi and Katsu Curry, Naoko has gained a reputation for her creative and delicious cuisine. Her bio showcases her dedication to her craft and her desire to bring the freshest ingredients to the table.",
    "years_of_experience": 11,
    "num_of_recipes": 4,
    "like": 2000,
    "recipes": ["Chirashi Sushi", "Katsu Curry", "Nikujaga", "Oyakodon"]
  },
  {
    "id": 9,
    "name": "Toshiro Nakamura",
    "picture": "https://media.timeout.com/images/105977061/image.jpg",
    "bio": "Toshiro Nakamura is a master of washoku cuisine, boasting 15 years of experience in the culinary world. He has won multiple awards for his dishes, which focus on creating harmonious and balanced flavors. With seven popular recipes to his name, including Saba Misoni and Tsukemono, Toshiro has become a respected figure in the culinary community. His bio highlights his passion for creating delicious and thoughtful dishes that showcase the best of Japanese cuisine.",
    "years_of_experience": 15,
    "num_of_recipes": 7,
    "like": 7000,
    "recipes": ["Saba Misoni", "Yakizakana", "Nimono", "Chawanmushi", "Tsukemono", "Oden", "Tonjiru"]
  }
]